const jwt = require('jsonwebtoken');

const protect = (req, res, next) => {
  // 1. جلب التوكن من الـ Headers (ترويسة الطلب)
  let token = req.header('Authorization');

  // 2. إذا لم يرسل المستخدم توكن، نمنعه من الدخول
  if (!token) {
    return res.status(401).json({ message: "غير مصرح لك بالدخول، يرجى تسجيل الدخول أولاً! 🛑" });
  }

  try {
    // التوكن عادة يُرسل مسبوقاً بكلمة Bearer، لذلك نزيلها لنقرأ التوكن الصافي
    if (token.startsWith('Bearer ')) {
      token = token.slice(7, token.length).trimLeft();
    }

    // 3. فك تشفير التوكن والتأكد من صحته باستخدام المفتاح السري الذي أنشأناه
    const verified = jwt.verify(token, process.env.JWT_SECRET);
    
    // 4. حفظ بيانات المستخدم (مثل الـ ID) بداخل الطلب لكي نستخدمها لاحقاً لجلب بياناته الخاصة
    req.user = verified;
    
    // 5. السماح بالمرور إلى الخطوة التالية
    next();
  } catch (error) {
    res.status(401).json({ message: "التوكن غير صالح أو انتهت صلاحيته! 🚫" });
  }
};

module.exports = protect;